var dom = document.getElementById("map1");
var myChart = echarts.init(dom);
var app = {};
option = null;

var hours = ['化工学院', '生物工程学院', '化学与分子工程学院', '药学院', '材料科学与工程学院', '信息科学与工程学院', '机械与动力工程学院', '资源与环境工程学院', '理学院', '商学院', '社会与公共管理学院',
    '艺术设计与传媒学院', '外国语学院', '法学院', '中德工学院', '体育科学与工程学院', '国际卓越工程师学院'];

var days = ['1952', '1953', '1955', '1957', '1958', '1971', '1972', '1973', '1979', '1981', '1982', '1983', '1985', '1986', '1987', '1992', '1993', '1994', '1996', '1998', '1999', '2000', '2002', '2003', '2010', '2013', '2018'];

var data = [[0, 0, 5, '无机化工、煤化工、精细化工'], [0, 2, 7, '精细化工'], [0, 4, 5, '无机非金属材料'], [0, 6, 5, '化工设备与机械'],
[1, 1, 5, '生物化工'], [1, 2, 5, '化学制药'], [1, 3, 5, '化学制药'],
[2, 0, 3, '有机化工'], [3, 0, 5, '化学工程'], [4, 0, 5, '石油化工、高分子化工'], [4, 5, 3, '生产过程自动化'], [5, 4, 5, '复合材料'],
[6, 0, 3, '感光材料'], [6, 2, 3, '感光材料'], [7, 1, 3, '生物化学'], [8, 2, 7, '应用化学'], [9, 6, 3, '流体机械'], [9, 7, 7, '环境工程'], [9, 8, 7, '应用数学、应用物理学'],
[10, 12, 3, '专门用途英语（科技）'], [10, 0, 5, '工业催化'], [11, 9, 3, '工业管理工程'], [12, 5, 5, '计算机软件'], [12, 6, 5, '机械设计及制造'], [13, 0, 3, '工业化学'], [13, 1, 3, '食品工程'], [13, 5, 3, '工业自动化仪表'], [13, 4, 5, '硅酸盐工程、高分子材料'], [13, 7, 5, '环境监测'],
[13, 11, 7, '工业设计'], [14, 0, 5, '工业分析'], [15, 9, 5, '国际企业管理'], [15, 12, 3, '专门用途英语（国际贸易）'],
[16, 0, 5, '化学工艺'], [16, 4, 7, '高分子材料与工程、工业自动化'], [16, 5, 5, '计算机及应用、检测技术及仪器仪表'], [16, 6, 5, '机械电子工程'], [16, 9, 7, '会计学、金融学、工业外贸'], [16, 1, 7, '食品科学与工程'], [16, 2, 7, '药物制剂'], [16, 3, 7, '药物制剂'], [16, 12, 7, '英语'], [16, 9, 5, '管理工程'],
[17, 10, 7, '行政管理学'], [18, 10, 7, '社会工作'], [19, 0, 7, '化学工程与工艺'], [19, 1, 7, '食品科学与工程'], [19, 2, 7, '制药工程'], [19, 3, 7, '制药工程'], [19, 4, 7, '无机非金属工程'], [19, 5, 7, '自动化、计算机科学与技术、测控技术与仪器'], [19, 6, 7, '过程装备与控制工程、机械设计制造及其自动化'], [19, 8, 7, '数学与应用数学'], [19, 9, 7, '工程管理、工商管理、市场营销、国际经济与贸易'], [19, 10, 7, '行政管理'],
[20, 0, 7, '轻化工程'], [20, 1, 7, '生物技术'], [21, 12, 7, '日语'], [21, 13, 7, '法学'], [21, 9, 7, '信息管理与信息系统'], [22, 10, 7, '公共事业管理'], [22, 0, 7, '油气储运工程'],
[23, 14, 7, '化学工程与工艺、电气工程及其自动化'], [24, 0, 7, '资源循环科学与工程', "http://baidu.com"], [25, 14, 7, '化学工程与工艺'], [26, 1, 7, '生物工程专业']];

option = {
    color: '#5bb2dd',

    // legend: {
    //     data: ['Punch Card'],
    //     left: 'right'
    // },
    polar: {},
    tooltip: {
        formatter: function (params) {
            console.log(params);
            return params.value[3] + ' 成立于 ' + days[params.value[0]];

        }
    },
    angleAxis: {
        type: 'category',
        data: hours,
        boundaryGap: false,
        splitLine: {
            show: true,
            lineStyle: {
                color: '#999',
                type: 'dashed'
            }
        },
        axisLine: {
            show: false
        },
        axisLabel: {
            color: '#4c9bfd'
        }
    },
    radiusAxis: {
        type: 'category',
        data: days,
        axisLine: {
            show: false
        },
        axisLabel: {
            color: '#FFFFFF',
            rotate: 45
        }
    },
    series: [{
        name: 'Punch Card',
        type: 'scatter',
        coordinateSystem: 'polar',
        symbolSize: function (val) {
            return val[2] * 2;
        },
        data: data,
        animationDelay: function (idx) {
            return idx * 100;
        }
    }]
};;
if (option && typeof option === "object") {
    myChart.setOption(option, true);
}
myChart.on("click", function (e) {
    // console.log(e);
    window.open(e.data[4]);
})
